//
//  LyricsCreaterViewModel.swift
//  UltimateChords
//
//  Created by Aung Ko Min on 22/3/22.
//

import UIKit

final class LyricsCreaterViewModel: NSObject, ObservableObject {
    
    @Published var lyrics = Lyrics(title: "", artist: "", text: perfect)
    
    func isValidArtist() -> Bool {
        !lyrics.artist.isEmpty && !lyrics.artist.isEmpty
    }
    
    func save() {
        _ = CLyrics.create(lyrics: self.lyrics)
    }
}

extension LyricsCreaterViewModel: UITextViewDelegate {
    
    func textViewDidChange(_ textView: UITextView) {
        lyrics.title = textView.text.words().randomElement() ?? ""
        lyrics.text = textView.text
    }
}

 let perfect = """

တရားမျှတ လွတ်လပ်ခြင်းနဲ့မသွေ၊
တို့ပြည်၊ တို့မြေ၊
များလူခပ်သိမ်း၊ ငြိမ်းချမ်းစေဖို့၊
ခွင့်တူညီမျှ၊ ဝါဒဖြူစင်တဲ့ပြည်၊
တို့ပြည်၊ တို့မြေ၊
ပြည်ထောင်စုအမွေ၊ အမြဲတည်တံ့စေ၊
အဓိဋ္ဌာန်ပြုပေ၊ ထိန်းသိမ်းစို့လေ

𝄆 ကမ္ဘာမကျေ၊ မြန်မာပြည်၊
တို့ဘိုးဘွား အမွေစစ်မို့ ချစ်မြတ်နိုးပေ။ 𝄇
ပြည်ထောင်စုကို အသက်ပေးလို့ တို့ကာကွယ်မလေ၊
ဒါတို့ပြည် ဒါတို့မြေ တို့ပိုင်နက်မြေ။
တို့ပြည် တို့မြေ အကျိုးကို ညီညာစွာတို့တစ်တွေ
ထမ်းဆောင်ပါစို့လေ တို့တာဝန်ပေ အဖိုးတန်မြေ။

တရားမျှတ လွတ်လပ်ခြင်းနဲ့မသွေ၊
တို့ပြည်၊ တို့မြေ၊
များလူခပ်သိမ်း၊ ငြိမ်းချမ်းစေဖို့၊
ခွင့်တူညီမျှ၊ ဝါဒဖြူစင်တဲ့ပြည်၊
တို့ပြည်၊ တို့မြေ၊
ပြည်ထောင်စုအမွေ၊ အမြဲတည်တံ့စေ၊
အဓိဋ္ဌာန်ပြုပေ၊ ထိန်းသိမ်းစို့လေ

𝄆 ကမ္ဘာမကျေ၊ မြန်မာပြည်၊
တို့ဘိုးဘွား အမွေစစ်မို့ ချစ်မြတ်နိုးပေ။ 𝄇
ပြည်ထောင်စုကို အသက်ပေးလို့ တို့ကာကွယ်မလေ၊
ဒါတို့ပြည် ဒါတို့မြေ တို့ပိုင်နက်မြေ။
တို့ပြည် တို့မြေ အကျိုးကို ညီညာစွာတို့တစ်တွေ
ထမ်းဆောင်ပါစို့လေ တို့တာဝန်ပေ အဖိုးတန်မြေ။

တရားမျှတ လွတ်လပ်ခြင်းနဲ့မသွေ၊
တို့ပြည်၊ တို့မြေ၊
များလူခပ်သိမ်း၊ ငြိမ်းချမ်းစေဖို့၊
ခွင့်တူညီမျှ၊ ဝါဒဖြူစင်တဲ့ပြည်၊
တို့ပြည်၊ တို့မြေ၊
ပြည်ထောင်စုအမွေ၊ အမြဲတည်တံ့စေ၊
အဓိဋ္ဌာန်ပြုပေ၊ ထိန်းသိမ်းစို့လေ

𝄆 ကမ္ဘာမကျေ၊ မြန်မာပြည်၊
တို့ဘိုးဘွား အမွေစစ်မို့ ချစ်မြတ်နိုးပေ။ 𝄇
ပြည်ထောင်စုကို အသက်ပေးလို့ တို့ကာကွယ်မလေ၊
ဒါတို့ပြည် ဒါတို့မြေ တို့ပိုင်နက်မြေ။
တို့ပြည် တို့မြေ အကျိုးကို ညီညာစွာတို့တစ်တွေ
ထမ်းဆောင်ပါစို့လေ တို့တာဝန်ပေ အဖိုးတန်မြေ။

တရားမျှတ လွတ်လပ်ခြင်းနဲ့မသွေ၊
တို့ပြည်၊ တို့မြေ၊
များလူခပ်သိမ်း၊ ငြိမ်းချမ်းစေဖို့၊
ခွင့်တူညီမျှ၊ ဝါဒဖြူစင်တဲ့ပြည်၊
တို့ပြည်၊ တို့မြေ၊
ပြည်ထောင်စုအမွေ၊ အမြဲတည်တံ့စေ၊
အဓိဋ္ဌာန်ပြုပေ၊ ထိန်းသိမ်းစို့လေ

𝄆 ကမ္ဘာမကျေ၊ မြန်မာပြည်၊
တို့ဘိုးဘွား အမွေစစ်မို့ ချစ်မြတ်နိုးပေ။ 𝄇
ပြည်ထောင်စုကို အသက်ပေးလို့ တို့ကာကွယ်မလေ၊
ဒါတို့ပြည် ဒါတို့မြေ တို့ပိုင်နက်မြေ။
တို့ပြည် တို့မြေ အကျိုးကို ညီညာစွာတို့တစ်တွေ
ထမ်းဆောင်ပါစို့လေ တို့တာဝန်ပေ အဖိုးတန်မြေ။
"""
